InformationRegisters/ИсторияИзмененияРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияРеквизитов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеБыло</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтало</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатураСплитТестирования</v8:Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыПартнерскихБонусныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияИзмененияРеквизитов/Ext/ManagerModule.bsl
//+++АК SHEP 2018.10.26 ИП-00019584
Функция ЗаполнитьДанныеДляИстории(Объект, СтрокаРеквизитов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИсторияИзмененияРеквизитов = Новый Структура;
	
	СтруктураДанныеБыли = Новый Структура(СтрокаРеквизитов);
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтруктураДанныеБыли = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, СтруктураДанныеБыли);
	Иначе
		// получаем значение заполнения по умолчанию
		МДОбъекта_Реквизиты = Объект.Метаданные().Реквизиты;
		Для Каждого КлючИЗначение Из СтруктураДанныеБыли Цикл
			ИмяПоляДляПроверкиИзменений = КлючИЗначение.Ключ;
			СтруктураДанныеБыли[ИмяПоляДляПроверкиИзменений] = МДОбъекта_Реквизиты[ИмяПоляДляПроверкиИзменений].ЗначениеЗаполнения;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из СтруктураДанныеБыли Цикл
		ИмяПоляДляПроверкиИзменений = КлючИЗначение.Ключ;
		Если Объект[ИмяПоляДляПроверкиИзменений] <> СтруктураДанныеБыли[ИмяПоляДляПроверкиИзменений] Тогда
			СтруктураИзменений = Новый Структура("ЗначениеБыло,ЗначениеСтало", СтруктураДанныеБыли[ИмяПоляДляПроверкиИзменений], Объект[ИмяПоляДляПроверкиИзменений]);
			ИсторияИзмененияРеквизитов.Вставить(ИмяПоляДляПроверкиИзменений, СтруктураИзменений);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИсторияИзмененияРеквизитов;
	
КонецФункции

//+++АК SHEP 2018.10.26 ИП-00019584
Процедура ЗаписатьИсторию(Ссылка, ИсторияИзмененияРеквизитов) Экспорт
	
	Если ИсторияИзмененияРеквизитов.Количество() > 0 Тогда
		
		Для Каждого СтруктураИзменений Из ИсторияИзмененияРеквизитов Цикл
			ЗаписьРС = РегистрыСведений["ИсторияИзмененияРеквизитов"].СоздатьМенеджерЗаписи();
			ЗаписьРС.Период = ТекущаяДата();
			ЗаписьРС.Ссылка = Ссылка;
			ЗаписьРС.ИмяРеквизита = СтруктураИзменений.Ключ;
			ЗаписьРС.Автор = ПараметрыСеанса.ТекущийПользователь;
			ЗаполнитьЗначенияСвойств(ЗаписьРС, СтруктураИзменений.Значение);
			ЗаписьРС.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
